zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/kl2x/pinctrl/MKL27Z256VLH4-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKL27Z256VLH4/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKL27Z256VLH4_
#define _ZEPHYR_DTS_BINDING_MKL27Z256VLH4_

#define ADC0_DM0_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_DM3_PTE23 KINETIS_MUX('E',23,0)
#define ADC0_DP0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_DP3_PTE22 KINETIS_MUX('E',22,0)
#define ADC0_SE0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_SE11_PTC2 KINETIS_MUX('C',2,0)
#define ADC0_SE12_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE13_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE14_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE15_PTC1 KINETIS_MUX('C',1,0)
#define ADC0_SE23_PTE30 KINETIS_MUX('E',30,0)
#define ADC0_SE3_PTE22 KINETIS_MUX('E',22,0)
#define ADC0_SE4a_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_SE4b_PTE29 KINETIS_MUX('E',29,0)
#define ADC0_SE5b_PTD1 KINETIS_MUX('D',1,0)
#define ADC0_SE6b_PTD5 KINETIS_MUX('D',5,0)
#define ADC0_SE7a_PTE23 KINETIS_MUX('E',23,0)
#define ADC0_SE7b_PTD6 KINETIS_MUX('D',6,0)
#define ADC0_SE8_PTB0 KINETIS_MUX('B',0,0)
#define ADC0_SE9_PTB1 KINETIS_MUX('B',1,0)
#define CLKOUT32K_PTE0 KINETIS_MUX('E',0,1)
#define CLKOUT_PTC3 KINETIS_MUX('C',3,5)
#define CMP0_IN0_PTC6 KINETIS_MUX('C',6,0)
#define CMP0_IN1_PTC7 KINETIS_MUX('C',7,0)
#define CMP0_IN4_PTE30 KINETIS_MUX('E',30,0)
#define CMP0_IN5_PTE29 KINETIS_MUX('E',29,0)
#define CMP0_OUT_PTC0 KINETIS_MUX('C',0,5)
#define CMP0_OUT_PTC5 KINETIS_MUX('C',5,6)
#define CMP0_OUT_PTE0 KINETIS_MUX('E',0,5)
#define DAC0_OUT_PTE30 KINETIS_MUX('E',30,0)
#define EXTAL0_PTA18 KINETIS_MUX('A',18,0)
#define EXTRG_IN_PTC0 KINETIS_MUX('C',0,3)
#define EXTRG_IN_PTC6 KINETIS_MUX('C',6,3)
#define FXIO0_D0_PTD0 KINETIS_MUX('D',0,6)
#define FXIO0_D1_PTD1 KINETIS_MUX('D',1,6)
#define FXIO0_D2_PTD2 KINETIS_MUX('D',2,6)
#define FXIO0_D3_PTD3 KINETIS_MUX('D',3,6)
#define FXIO0_D4_PTD4 KINETIS_MUX('D',4,6)
#define FXIO0_D4_PTE20 KINETIS_MUX('E',20,6)
#define FXIO0_D5_PTD5 KINETIS_MUX('D',5,6)
#define FXIO0_D5_PTE21 KINETIS_MUX('E',21,6)
#define FXIO0_D6_PTD6 KINETIS_MUX('D',6,6)
#define FXIO0_D6_PTE22 KINETIS_MUX('E',22,6)
#define FXIO0_D7_PTD7 KINETIS_MUX('D',7,6)
#define FXIO0_D7_PTE23 KINETIS_MUX('E',23,6)
#define I2C0_SCL_PTB0 KINETIS_MUX('B',0,2)
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2)
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5)
#define I2C0_SDA_PTB1 KINETIS_MUX('B',1,2)
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2)
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5)
#define I2C1_SCL_PTA3 KINETIS_MUX('A',3,2)
#define I2C1_SCL_PTC1 KINETIS_MUX('C',1,2)
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6)
#define I2C1_SDA_PTA4 KINETIS_MUX('A',4,2)
#define I2C1_SDA_PTC2 KINETIS_MUX('C',2,2)
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6)
#define KINETIS_MUX(port, pin, mux)		 (((((port) - 'A') & 0xF) << 28) |	 (((pin) & 0x3F) << 22) |		 (((mux) & 0x7) << 8))
#define LLWU_P10_PTC6 KINETIS_MUX('C',6,1)
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1)
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1)
#define LLWU_P5_PTB0 KINETIS_MUX('B',0,1)
#define LLWU_P6_PTC1 KINETIS_MUX('C',1,1)
#define LLWU_P7_PTC3 KINETIS_MUX('C',3,1)
#define LLWU_P8_PTC4 KINETIS_MUX('C',4,1)
#define LLWU_P9_PTC5 KINETIS_MUX('C',5,1)
#define LPTMR0_ALT1_PTA19 KINETIS_MUX('A',19,6)
#define LPTMR0_ALT1_PTE30 KINETIS_MUX('E',30,6)
#define LPTMR0_ALT2_PTC5 KINETIS_MUX('C',5,3)
#define LPUART0_RX_PTA1 KINETIS_MUX('A',1,2)
#define LPUART0_RX_PTB16 KINETIS_MUX('B',16,3)
#define LPUART0_RX_PTD6 KINETIS_MUX('D',6,3)
#define LPUART0_RX_PTE21 KINETIS_MUX('E',21,4)
#define LPUART0_TX_PTA2 KINETIS_MUX('A',2,2)
#define LPUART0_TX_PTB17 KINETIS_MUX('B',17,3)
#define LPUART0_TX_PTD7 KINETIS_MUX('D',7,3)
#define LPUART0_TX_PTE20 KINETIS_MUX('E',20,4)
#define LPUART1_RX_PTA18 KINETIS_MUX('A',18,3)
#define LPUART1_RX_PTC3 KINETIS_MUX('C',3,3)
#define LPUART1_RX_PTE1 KINETIS_MUX('E',1,3)
#define LPUART1_TX_PTA19 KINETIS_MUX('A',19,3)
#define LPUART1_TX_PTC4 KINETIS_MUX('C',4,3)
#define LPUART1_TX_PTE0 KINETIS_MUX('E',0,3)
#define LPUART1_TX_PTE30 KINETIS_MUX('E',30,5)
#define NMI_b_PTA4 KINETIS_MUX('A',4,7)
#define PTA0 KINETIS_MUX('A',0,1)
#define PTA1 KINETIS_MUX('A',1,1)
#define PTA12 KINETIS_MUX('A',12,1)
#define PTA13 KINETIS_MUX('A',13,1)
#define PTA18 KINETIS_MUX('A',18,1)
#define PTA19 KINETIS_MUX('A',19,1)
#define PTA2 KINETIS_MUX('A',2,1)
#define PTA20 KINETIS_MUX('A',20,1)
#define PTA3 KINETIS_MUX('A',3,1)
#define PTA4 KINETIS_MUX('A',4,1)
#define PTA5 KINETIS_MUX('A',5,1)
#define PTB0 KINETIS_MUX('B',0,1)
#define PTB1 KINETIS_MUX('B',1,1)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB18 KINETIS_MUX('B',18,1)
#define PTB19 KINETIS_MUX('B',19,1)
#define PTB2 KINETIS_MUX('B',2,1)
#define PTB3 KINETIS_MUX('B',3,1)
#define PTC0 KINETIS_MUX('C',0,1)
#define PTC1 KINETIS_MUX('C',1,1)
#define PTC2 KINETIS_MUX('C',2,1)
#define PTC3 KINETIS_MUX('C',3,1)
#define PTC4 KINETIS_MUX('C',4,1)
#define PTC5 KINETIS_MUX('C',5,1)
#define PTC6 KINETIS_MUX('C',6,1)
#define PTC7 KINETIS_MUX('C',7,1)
#define PTD0 KINETIS_MUX('D',0,1)
#define PTD1 KINETIS_MUX('D',1,1)
#define PTD2 KINETIS_MUX('D',2,1)
#define PTD3 KINETIS_MUX('D',3,1)
#define PTD4 KINETIS_MUX('D',4,1)
#define PTD5 KINETIS_MUX('D',5,1)
#define PTD6 KINETIS_MUX('D',6,1)
#define PTD7 KINETIS_MUX('D',7,1)
#define PTE0 KINETIS_MUX('E',0,1)
#define PTE1 KINETIS_MUX('E',1,1)
#define PTE20 KINETIS_MUX('E',20,1)
#define PTE21 KINETIS_MUX('E',21,1)
#define PTE22 KINETIS_MUX('E',22,1)
#define PTE23 KINETIS_MUX('E',23,1)
#define PTE24 KINETIS_MUX('E',24,1)
#define PTE25 KINETIS_MUX('E',25,1)
#define PTE29 KINETIS_MUX('E',29,1)
#define PTE30 KINETIS_MUX('E',30,1)
#define PTE31 KINETIS_MUX('E',31,1)
#define RESET_b_PTA20 KINETIS_MUX('A',20,7)
#define RTC_CLKIN_PTC1 KINETIS_MUX('C',1,1)
#define RTC_CLKOUT_PTE0 KINETIS_MUX('E',0,4)
#define SPI0_MISO_PTC6 KINETIS_MUX('C',6,5)
#define SPI0_MISO_PTC7 KINETIS_MUX('C',7,2)
#define SPI0_MISO_PTD2 KINETIS_MUX('D',2,5)
#define SPI0_MISO_PTD3 KINETIS_MUX('D',3,2)
#define SPI0_MOSI_PTC6 KINETIS_MUX('C',6,2)
#define SPI0_MOSI_PTC7 KINETIS_MUX('C',7,5)
#define SPI0_MOSI_PTD2 KINETIS_MUX('D',2,2)
#define SPI0_MOSI_PTD3 KINETIS_MUX('D',3,5)
#define SPI0_SCK_PTC5 KINETIS_MUX('C',5,2)
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2)
#define SPI0_SS_PTC4 KINETIS_MUX('C',4,2)
#define SPI0_SS_PTD0 KINETIS_MUX('D',0,2)
#define SPI1_MISO_PTB16 KINETIS_MUX('B',16,5)
#define SPI1_MISO_PTB17 KINETIS_MUX('B',17,2)
#define SPI1_MISO_PTD6 KINETIS_MUX('D',6,5)
#define SPI1_MISO_PTD7 KINETIS_MUX('D',7,2)
#define SPI1_MISO_PTE0 KINETIS_MUX('E',0,2)
#define SPI1_MISO_PTE1 KINETIS_MUX('E',1,5)
#define SPI1_MOSI_PTB16 KINETIS_MUX('B',16,2)
#define SPI1_MOSI_PTB17 KINETIS_MUX('B',17,5)
#define SPI1_MOSI_PTD6 KINETIS_MUX('D',6,2)
#define SPI1_MOSI_PTD7 KINETIS_MUX('D',7,5)
#define SPI1_MOSI_PTE1 KINETIS_MUX('E',1,2)
#define SPI1_SCK_PTC3 KINETIS_MUX('C',3,2)
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,2)
#define SPI1_SS_PTD4 KINETIS_MUX('D',4,2)
#define SWD_CLK_PTA0 KINETIS_MUX('A',0,7)
#define SWD_DIO_PTA3 KINETIS_MUX('A',3,7)
#define TPM0_CH0_PTA3 KINETIS_MUX('A',3,3)
#define TPM0_CH0_PTC1 KINETIS_MUX('C',1,4)
#define TPM0_CH0_PTD0 KINETIS_MUX('D',0,4)
#define TPM0_CH0_PTE24 KINETIS_MUX('E',24,3)
#define TPM0_CH1_PTA4 KINETIS_MUX('A',4,3)
#define TPM0_CH1_PTC2 KINETIS_MUX('C',2,4)
#define TPM0_CH1_PTD1 KINETIS_MUX('D',1,4)
#define TPM0_CH1_PTE25 KINETIS_MUX('E',25,3)
#define TPM0_CH2_PTA5 KINETIS_MUX('A',5,3)
#define TPM0_CH2_PTC3 KINETIS_MUX('C',3,4)
#define TPM0_CH2_PTD2 KINETIS_MUX('D',2,4)
#define TPM0_CH2_PTE29 KINETIS_MUX('E',29,3)
#define TPM0_CH3_PTC4 KINETIS_MUX('C',4,4)
#define TPM0_CH3_PTD3 KINETIS_MUX('D',3,4)
#define TPM0_CH3_PTE30 KINETIS_MUX('E',30,3)
#define TPM0_CH4_PTD4 KINETIS_MUX('D',4,4)
#define TPM0_CH4_PTE31 KINETIS_MUX('E',31,3)
#define TPM0_CH5_PTA0 KINETIS_MUX('A',0,3)
#define TPM0_CH5_PTD5 KINETIS_MUX('D',5,4)
#define TPM1_CH0_PTA12 KINETIS_MUX('A',12,3)
#define TPM1_CH0_PTB0 KINETIS_MUX('B',0,3)
#define TPM1_CH0_PTE20 KINETIS_MUX('E',20,3)
#define TPM1_CH1_PTA13 KINETIS_MUX('A',13,3)
#define TPM1_CH1_PTB1 KINETIS_MUX('B',1,3)
#define TPM1_CH1_PTE21 KINETIS_MUX('E',21,3)
#define TPM2_CH0_PTA1 KINETIS_MUX('A',1,3)
#define TPM2_CH0_PTB18 KINETIS_MUX('B',18,3)
#define TPM2_CH0_PTB2 KINETIS_MUX('B',2,3)
#define TPM2_CH0_PTE22 KINETIS_MUX('E',22,3)
#define TPM2_CH1_PTA2 KINETIS_MUX('A',2,3)
#define TPM2_CH1_PTB19 KINETIS_MUX('B',19,3)
#define TPM2_CH1_PTB3 KINETIS_MUX('B',3,3)
#define TPM2_CH1_PTE23 KINETIS_MUX('E',23,3)
#define TPM_CLKIN0_PTA18 KINETIS_MUX('A',18,4)
#define TPM_CLKIN0_PTB16 KINETIS_MUX('B',16,4)
#define TPM_CLKIN0_PTE29 KINETIS_MUX('E',29,4)
#define TPM_CLKIN1_PTA19 KINETIS_MUX('A',19,4)
#define TPM_CLKIN1_PTB17 KINETIS_MUX('B',17,4)
#define TPM_CLKIN1_PTE30 KINETIS_MUX('E',30,4)
#define UART2_RX_PTD2 KINETIS_MUX('D',2,3)
#define UART2_RX_PTD4 KINETIS_MUX('D',4,3)
#define UART2_RX_PTE23 KINETIS_MUX('E',23,4)
#define UART2_TX_PTD3 KINETIS_MUX('D',3,3)
#define UART2_TX_PTD5 KINETIS_MUX('D',5,3)
#define UART2_TX_PTE22 KINETIS_MUX('E',22,4)
#define USB_CLKIN_PTA5 KINETIS_MUX('A',5,2)
#define USB_SOF_OUT_PTC0 KINETIS_MUX('C',0,4)
#define USB_SOF_OUT_PTC7 KINETIS_MUX('C',7,3)
#define XTAL0_PTA19 KINETIS_MUX('A',19,0)
#define CMP0_IN2_PTC8 KINETIS_MUX('C',8,0)
#define CMP0_IN3_PTC9 KINETIS_MUX('C',9,0)
#define I2C0_SCL_PTC8 KINETIS_MUX('C',8,2)
#define I2C0_SDA_PTC9 KINETIS_MUX('C',9,2)
#define I2C1_SCL_PTC10 KINETIS_MUX('C',10,2)
#define I2C1_SDA_PTC11 KINETIS_MUX('C',11,2)
#define I2S0_MCLK_PTC4 KINETIS_MUX('C',4,5)
#define I2S0_MCLK_PTC6 KINETIS_MUX('C',6,6)
#define I2S0_MCLK_PTC8 KINETIS_MUX('C',8,4)
#define I2S0_RXD0_PTC11 KINETIS_MUX('C',11,4)
#define I2S0_RXD0_PTC5 KINETIS_MUX('C',5,4)
#define I2S0_RX_BCLK_PTC6 KINETIS_MUX('C',6,4)
#define I2S0_RX_BCLK_PTC9 KINETIS_MUX('C',9,4)
#define I2S0_RX_FS_PTC10 KINETIS_MUX('C',10,4)
#define I2S0_RX_FS_PTC7 KINETIS_MUX('C',7,4)
#define I2S0_TXD0_PTA12 KINETIS_MUX('A',12,6)
#define I2S0_TXD0_PTC0 KINETIS_MUX('C',0,6)
#define I2S0_TXD0_PTC1 KINETIS_MUX('C',1,6)
#define I2S0_TX_BCLK_PTA5 KINETIS_MUX('A',5,6)
#define I2S0_TX_BCLK_PTB18 KINETIS_MUX('B',18,4)
#define I2S0_TX_BCLK_PTC3 KINETIS_MUX('C',3,6)
#define I2S0_TX_FS_PTA13 KINETIS_MUX('A',13,6)
#define I2S0_TX_FS_PTB19 KINETIS_MUX('B',19,4)
#define I2S0_TX_FS_PTC2 KINETIS_MUX('C',2,6)
#define PTC10 KINETIS_MUX('C',10,1)
#define PTC11 KINETIS_MUX('C',11,1)
#define PTC8 KINETIS_MUX('C',8,1)
#define PTC9 KINETIS_MUX('C',9,1)
#define TPM0_CH4_PTC8 KINETIS_MUX('C',8,3)
#define TPM0_CH5_PTC9 KINETIS_MUX('C',9,3)

#endif /* _ZEPHYR_DTS_BINDING_MKL27Z256VLH4_ */
